In [45]:
#import dependencies
import pandas as pd
from sqlalchemy import create_engine
from datetime import datetime
import numpy as np
import psycopg2 as pg
import pandas.io.sql as psql
import matplotlib as plt

In [46]:
#Load Amazon file
AMZN_file = "Asset_Classes/AMZN_Historical.csv"
AMZN_df = pd.read_csv(AMZN_file)
AMZN_df.head(10)

         date         open         high          low        close   volume
0  12/30/2019  1874.000000  1884.000000  1840.619995  1846.890015  3674700
1  12/31/2019  1842.000000  1853.260010  1832.229980  1847.839966  2506500
2    1/2/2020  1875.000000  1898.010010  1864.150024  1898.010010  4029000
3    1/3/2020  1864.500000  1886.199951  1864.500000  1874.969971  3764400
4    1/6/2020  1860.000000  1903.689941  1860.000000  1902.880005  4061800
5    1/7/2020  1904.500000  1913.890015  1892.040039  1906.859985  4044900
6    1/8/2020  1898.040039  1911.000000  1886.439941  1891.969971  3508000
7    1/9/2020  1909.890015  1917.819946  1895.800049  1901.050049  3167300
8   1/10/2020  1905.369995  1906.939941  1880.000000  1883.160034  2853700
9   1/13/2020  1891.310059  1898.000000  1880.800049  1891.300049  2780800

In [47]:
#Get only the columns we need
AMZN_organized = AMZN_df[["date","close"]]
AMZN_organized.head()

         date        close
0  12/30/2019  1846.890015
1  12/31/2019  1847.839966
2    1/2/2020  1898.010010
3    1/3/2020  1874.969971
4    1/6/2020  1902.880005

In [48]:
# Connect to database
connection_string = "postgres:postgres@localhost:5432/Asset_Classes"
engine = create_engine(f'postgresql://{connection_string}')

In [49]:
# Make sure connecting the the database worked by getting the table names
engine.table_names()

['amzn', 'gld', 'nflx', 'shy', 'sp', 'uso', 'zm']

In [51]:
#Put our organized Pandas table into the SQL table
AMZN_organized.to_sql(name='amzn', con=engine, if_exists='append', index=False)

In [53]:
#make sure it executed correctly
engine.execute("SELECT * from amzn;").fetchall()

[(datetime.date(2019, 12, 30), 1846.890015),
 (datetime.date(2019, 12, 31), 1847.839966),
 (datetime.date(2020, 1, 2), 1898.0100100000002),
 (datetime.date(2020, 1, 3), 1874.969971),
 (datetime.date(2020, 1, 6), 1902.880005),
 (datetime.date(2020, 1, 7), 1906.859985),
 (datetime.date(2020, 1, 8), 1891.969971),
 (datetime.date(2020, 1, 9), 1901.050049),
 (datetime.date(2020, 1, 10), 1883.160034),
 (datetime.date(2020, 1, 13), 1891.300049),
 (datetime.date(2020, 1, 14), 1869.439941),
 (datetime.date(2020, 1, 15), 1862.02002),
 (datetime.date(2020, 1, 16), 1877.939941),
 (datetime.date(2020, 1, 17), 1864.719971),
 (datetime.date(2020, 1, 21), 1892.0),
 (datetime.date(2020, 1, 22), 1887.459961),
 (datetime.date(2020, 1, 23), 1884.5799559999998),
 (datetime.date(2020, 1, 24), 1861.640015),
 (datetime.date(2020, 1, 27), 1828.339966),
 (datetime.date(2020, 1, 28), 1853.25),
 (datetime.date(2020, 1, 29), 1858.0),
 (datetime.date(2020, 1, 30), 1870.680054),
 (datetime.date(2020, 1, 31), 2008.719971),
 (datetime.date(2020, 2, 3), 2004.199951),
 (datetime.date(2020, 2, 4), 2049.669922),
 (datetime.date(2020, 2, 5), 2039.869995),
 (datetime.date(2020, 2, 6), 2050.22998),
 (datetime.date(2020, 2, 7), 2079.280029),
 (datetime.date(2020, 2, 10), 2133.909912),
 (datetime.date(2020, 2, 11), 2150.800049),
 (datetime.date(2020, 2, 12), 2160.0),
 (datetime.date(2020, 2, 13), 2149.8701170000004),
 (datetime.date(2020, 2, 14), 2134.8701170000004),
 (datetime.date(2020, 2, 18), 2155.669922),
 (datetime.date(2020, 2, 19), 2170.219971),
 (datetime.date(2020, 2, 20), 2153.100098),
 (datetime.date(2020, 2, 21), 2095.969971),
 (datetime.date(2020, 2, 24), 2009.290039),
 (datetime.date(2020, 2, 25), 1972.7399899999998),
 (datetime.date(2020, 2, 26), 1979.589966),
 (datetime.date(2020, 2, 27), 1884.300049),
 (datetime.date(2020, 2, 28), 1883.75),
 (datetime.date(2020, 3, 2), 1953.949951),
 (datetime.date(2020, 3, 3), 1908.9899899999998),
 (datetime.date(2020, 3, 4), 1975.8299559999998),
 (datetime.date(2020, 3, 5), 1924.030029),
 (datetime.date(2020, 3, 6), 1901.089966),
 (datetime.date(2020, 3, 9), 1800.609985),
 (datetime.date(2020, 3, 10), 1891.819946),
 (datetime.date(2020, 3, 11), 1820.859985),
 (datetime.date(2020, 3, 12), 1676.609985),
 (datetime.date(2020, 3, 13), 1785.0),
 (datetime.date(2020, 3, 16), 1689.1500239999998),
 (datetime.date(2020, 3, 17), 1807.839966),
 (datetime.date(2020, 3, 18), 1830.0),
 (datetime.date(2020, 3, 19), 1880.930054),
 (datetime.date(2020, 3, 20), 1846.089966),
 (datetime.date(2020, 3, 23), 1902.8299559999998),
 (datetime.date(2020, 3, 24), 1940.0999760000002),
 (datetime.date(2020, 3, 25), 1885.839966),
 (datetime.date(2020, 3, 26), 1955.4899899999998),
 (datetime.date(2020, 3, 27), 1900.0999760000002),
 (datetime.date(2020, 3, 30), 1963.949951),
 (datetime.date(2020, 3, 31), 1949.719971),
 (datetime.date(2020, 4, 1), 1907.699951),
 (datetime.date(2020, 4, 2), 1918.8299559999998),
 (datetime.date(2020, 4, 3), 1906.589966),
 (datetime.date(2020, 4, 6), 1997.589966),
 (datetime.date(2020, 4, 7), 2011.5999760000002),
 (datetime.date(2020, 4, 8), 2043.0),
 (datetime.date(2020, 4, 9), 2042.7600100000002),
 (datetime.date(2020, 4, 13), 2168.8701170000004),
 (datetime.date(2020, 4, 14), 2283.320068),
 (datetime.date(2020, 4, 15), 2307.679932),
 (datetime.date(2020, 4, 16), 2408.189941),
 (datetime.date(2020, 4, 17), 2375.0),
 (datetime.date(2020, 4, 20), 2393.610107),
 (datetime.date(2020, 4, 21), 2328.1201170000004),
 (datetime.date(2020, 4, 22), 2363.48999),
 (datetime.date(2020, 4, 23), 2399.449951),
 (datetime.date(2020, 4, 24), 2410.219971)]

In [65]:
#Load Gold file
GLD_file = "Asset_Classes/GLD_Historical.csv"
GLD_df = pd.read_csv(GLD_file)
GLD_df.head()

         date        open        high         low       close    volume
0  12/30/2019  142.559998  142.800003  142.460007  142.630005   4810600
1  12/31/2019  143.309998  143.600006  142.800003  142.899994   5313500
2    1/2/2020  143.860001  144.210007  143.399994  143.949997   7733800
3    1/3/2020  145.750000  146.320007  145.399994  145.860001  12272800
4    1/6/2020  148.440002  148.479996  146.949997  147.389999  14403300

In [55]:
#Get only the columns we need
GLD_organized = GLD_df[["date","close"]]
GLD_organized.head()

         date       close
0  12/30/2019  142.630005
1  12/31/2019  142.899994
2    1/2/2020  143.949997
3    1/3/2020  145.860001
4    1/6/2020  147.389999

In [56]:
#Put our organized Pandas table into the SQL table
GLD_organized.to_sql(name='gld', con=engine, if_exists='append', index=False)

In [64]:
engine.execute("SELECT * from gld;")

In [60]:
#Load Netflix file
NFLX_file = "Asset_Classes/NFLX_Historical.csv"
NFLX_df = pd.read_csv(NFLX_file)
NFLX_df.head()

         date        open        high         low       close   volume
0  12/30/2019  329.079987  329.190002  322.859985  323.309998  4311500
1  12/31/2019  322.000000  324.920013  321.089996  323.570007  3713300
2    1/2/2020  326.100006  329.980011  324.779999  329.809998  4485800
3    1/3/2020  326.779999  329.859985  325.529999  325.899994  3806900
4    1/6/2020  323.119995  336.359985  321.200012  335.829987  5663100

In [59]:
#Get only the columns we need
NFLX_organized = NFLX_df[["date","close"]]
NFLX_organized.head()

         date       close
0  12/30/2019  323.309998
1  12/31/2019  323.570007
2    1/2/2020  329.809998
3    1/3/2020  325.899994
4    1/6/2020  335.829987

In [61]:
#Put our organized Pandas table into the SQL table
NFLX_organized.to_sql(name='nflx', con=engine, if_exists='append', index=False)

In [63]:
engine.execute("SELECT * from nflx;")

In [68]:
#Load SHY file
SHY_file = "Asset_Classes/SHY_Historical.csv"
SHY_df = pd.read_csv(SHY_file)
SHY_df.head()

         date       open       high        low      close   volume
0  12/30/2019  84.599998  84.660004  84.599998  84.639999  1630700
1  12/31/2019  84.639999  84.669998  84.610001  84.629997  3025600
2    1/2/2020  84.669998  84.709999  84.639999  84.669998  2665200
3    1/3/2020  84.720001  84.760002  84.690002  84.739998  2039900
4    1/6/2020  84.730003  84.739998  84.680000  84.709999  1132100

In [70]:
#Get only the columns we need
SHY_organized = SHY_df[["date","close"]]
SHY_organized.head()

         date      close
0  12/30/2019  84.639999
1  12/31/2019  84.629997
2    1/2/2020  84.669998
3    1/3/2020  84.739998
4    1/6/2020  84.709999

In [71]:
#Put our organized Pandas table into the SQL table
SHY_organized.to_sql(name='shy', con=engine, if_exists='append', index=False)

In [72]:
engine.execute("SELECT * from nflx;")

In [80]:
#Load S&P 500 file
SP_file = "Asset_Classes/SP_Historical.csv"
SP_df = pd.read_csv(SP_file)
SP_df.head()

         date     open     high      low   close   volume
0  12/30/2019  3238.25  3244.25  3217.25  3223.5   984389
1  12/31/2019  3223.25  3236.25  3213.00  3231.0  1124598
2    1/2/2020  3237.00  3261.75  3234.25  3259.0  1157924
3    1/3/2020  3261.00  3263.50  3206.75  3235.5  1416241
4    1/6/2020  3220.25  3249.50  3208.75  3243.5  1755057

In [81]:
#Get only the columns we need
SP_organized = SP_df[["date","close"]]
SP_organized.head()

         date   close
0  12/30/2019  3223.5
1  12/31/2019  3231.0
2    1/2/2020  3259.0
3    1/3/2020  3235.5
4    1/6/2020  3243.5

In [82]:
#Put our organized Pandas table into the SQL table
SP_organized.to_sql(name='sp', con=engine, if_exists='append', index=False)

In [83]:
#Load USO file
USO_file = "Asset_Classes/SP_Historical.csv"
USO_df = pd.read_csv(USO_file)
USO_df.head()

         date     open     high      low   close   volume
0  12/30/2019  3238.25  3244.25  3217.25  3223.5   984389
1  12/31/2019  3223.25  3236.25  3213.00  3231.0  1124598
2    1/2/2020  3237.00  3261.75  3234.25  3259.0  1157924
3    1/3/2020  3261.00  3263.50  3206.75  3235.5  1416241
4    1/6/2020  3220.25  3249.50  3208.75  3243.5  1755057

In [84]:
#Get only the columns we need
USO_organized = USO_df[["date","close"]]
USO_organized.head()

         date   close
0  12/30/2019  3223.5
1  12/31/2019  3231.0
2    1/2/2020  3259.0
3    1/3/2020  3235.5
4    1/6/2020  3243.5

In [85]:
#Put our organized Pandas table into the SQL table
USO_organized.to_sql(name='uso', con=engine, if_exists='append', index=False)

In [86]:
#Load ZOOM file
ZM_file = "Asset_Classes/ZM_Historical.csv"
ZM_df = pd.read_csv(ZM_file)
ZM_df.head()

         date       open       high        low      close   volume
0  12/30/2019  66.559998  67.180000  65.519997  66.790001  1162700
1  12/31/2019  66.379997  68.180000  66.309998  68.040001  1351400
2    1/2/2020  68.800003  69.235001  68.019997  68.720001  1315500
3    1/3/2020  67.620003  68.680000  67.099998  67.279999  1127900
4    1/6/2020  66.629997  70.495003  65.811996  70.320000  3151600

In [87]:
#Get only the columns we need
ZM_organized = USO_df[["date","close"]]
ZM_organized.head()

         date   close
0  12/30/2019  3223.5
1  12/31/2019  3231.0
2    1/2/2020  3259.0
3    1/3/2020  3235.5
4    1/6/2020  3243.5

In [88]:
#Put our organized Pandas table into the SQL table
ZM_organized.to_sql(name='zm', con=engine, if_exists='append', index=False)